Repository: mhmdajoor5/Jetak-mobile-client-develop
Catalog: lib/l10n/intl_*.arb
Languages: ar, he

source: Login
ar: تسجيل الدخول
he: התחברות

source: Skip
ar: تخطي
he: דלג

source: About
ar: نبذة
he: אודות

source: Submit
ar: ارسال
he: שלח

source: Verify
ar: التحقق
he: אמת

source: Category
ar: الفئة
he: קטגוריה

source: Checkout
ar: إتمام الشراء
he: צ׳קאאוט

source: Subtotal
ar: المجموع الفرعي
he: סכום ביניים

source: Estimated time:
ar: الوقت المتوقع:
he: זמן משוער:

source: Total
ar: المجموع
he: סה"כ

source: Menu
ar: المينيو
he: תפריט

source: Information
ar: معلومات
he: מידע

source: g
ar: جم
he: גרם

source: Extras
ar: إضافات
he: תוספות

source: Ingredients
ar: المكونات
he: מרכיבים

source: Nutrition
ar: العناصر الغذائية
he: ערכים תזונתיים

source: Reviews
ar: التعليقات
he: ביקורות

source: Quantity
ar: الكمية
he: כמות

source: Faq
ar: الاسئلة الشائعة
he: שאלות נפוצות

source: Notifications
ar: إشعارات
he: התראות

source: Confirmation
ar: التأكيد
he: אישור

source: TAX
ar: ضريبة
he: מס

source: My Orders
ar: طلباتي
he: ההזמנות שלי

source: Profile
ar: الملف الشخصي
he: פרופיל

source: Favorites
ar: المفضلة
he: מועדפים

source: Home
ar: المنزل
he: בית

source: Payment Options
ar: خيارات الدفع
he: אפשרויות תשלום

source: Cash on delivery
ar: الدفع عن الاستلام
he: תשלום במזומן

source: PayPal Payment
ar: الدفع بواسطة Paypal
he: תשלום ב-PayPal

source: Recent Orders
ar: الطلبات الأخيرة
he: הזמנות אחרונות

source: Settings
ar: الإعدادات
he: הגדרות

source: Profile Settings
ar: إعدادات الملف الشخصي
he: הגדרות פרופיל

source: Full name
ar: الاسم الكامل
he: שם מלא

source: Email
ar: البريد الإلكتروني
he: אימייל

source: Phone
ar: رقم الجوال
he: טלפון

source: Address
ar: العنوان
he: כתובת

source: Payments Settings
ar: إعدادات الدفع
he: הגדרות תשלומים

source: Default Credit Card
ar: بطاقة الائتمان الافتراضية
he: כרטיס אשראי ברירת מחדל

source: App Settings
ar: إعدادات التطبيق
he: הגדרות אפליקציה

source: Languages
ar: اللغات
he: שפות

source: English
ar: الإنجليزية
he: אנגלית

source: Help & Support
ar: المساعدة
he: עזרה ותמיכה

source: Register
ar: تسجيل
he: הרשמה

source: Let's Start with register!
ar: لنبدأ بالتسجيل!
he: בואו נתחיל עם הרשמה!

source: Should be more than 3 letters
ar: يجب أن يكون أكثر من 3 أحرف
he: צריך להיות יותר מ-3 אותיות

source: John Doe
ar: فلان الفلاني
he: יהון דו

source: Should be a valid email
ar: يجب أن يكون بريدًا إلكترونيًا صالحًا
he: כתובת אימייל לא תקינה

source: Should be more than 6 letters
ar: يجب أن يكون أكثر من 6 أحرف
he: צריך להיות יותר מ-6 אותיות

source: Password
ar: كلمه المرور
he: סיסמה

source: I have account? Back to login
ar: لدي حساب، العودة لتسجيل الدخول
he: יש לי חשבון? חזרה להתחברות

source: Multi-Restaurants
ar: عدة مطابخ
he: מסעדות מרובות

source: Tracking Order
ar: تتبع الطلب
he: מעקב אחר ההזמנה

source: Discover & Explorer
ar: استكشاف
he: גליה וחוקר

# you_can_discover_restaurants
source: You can discover restaurants & fastfood arround you and choose you best meal after few minutes we prepare and delivere it for you
ar: يمكنك استكتشاف المطابخ المحيطة بك واختيار أفضل وجبة لك
he: אתה יכול לגלות מסעדות ואוכל מהיר באזור שלך ולבחור את המנה הטובה ביותר שלך לאחר כמה דקות אנו מכינים ומספקים אותה עבורך

source: Reset Cart?
ar: إعادة تعيين سلة التسوق
he: אתחל עגלה

source: Cart
ar: سلة التسوق
he: עגלה

source: Shopping Cart
ar: سلة التسوق
he: עגלת קניות

source: Verify your quantity and click checkout
ar: تحقق من الكمية واضغط على الدفع
he: אמת את כמותך ולחץ על קופה

source: Let's Start with Login!
ar: لنبدأ بتسجيل الدخول!
he: בואו נתחיל עם התחברות!

source: Should be more than 3 characters
ar: يجب أن يكون أكثر من 3 أحرف
he: חייב להכיל יותר מ-3 תווים

# you_must_add_foods_of_the_same_restaurants_choose_one
source: You must add foods of the same restaurants choose one restaurants only!
ar: فضلا اختيار الاصناف من مطبخ واحد في كل طلب
he: עליך להוסיף מזונות מאותה מסעדה

source: Reset your cart and order meals form this restaurant
ar: افرغ سلة التسوق واضف اختياراتي من هذا المطبخ
he: אתחל את העגלה והזמן ארוחות מהמסעדה הזו

source: Keep your old meals of this restaurant
ar: لا تفرغ السلة واحتفظ باختياراتي السابقة
he: שמור על הארוחות הישנות שלך מהמסעדה הזו

source: Reset
ar: إعادة تعيين
he: אתחול

source: Close
ar: اغلاق
he: סגור

source: Application Preferences
ar: تفضيلات التطبيق
he: העדפות האפליקציה

source: Help & Support
ar: المساعدة
he: עזרה ותמיכה

source: Cancel
ar: إلغاء
he: ביטול

source: Light Mode
ar: الوضع الفاتح
he: מצב אור

source: Dark Mode
ar: الوضع الداكن
he: מצב חשוך

source: Log out
ar: تسجيل الخروج
he: התנתקות

source: Version
ar: الإصدار
he: גרסה

source: D'ont have any item in your cart
ar: سلة التسوق فارغة
he: אין פריטים בעגלה שלך

source: Start Exploring
ar: استكشف الآن
he: התחל לחקור

source: D'ont have any item in the notification list
ar: قائمة الاشعارات فارغة
he: אין פריטים ברשימת ההתראות

source: Payment Settings
ar: إعدادات الدفع
he: הגדרות תשלום

source: Not a valid number
ar: رقم غير صحيح
he: לא מספר חוקי

source: Not a valid date
ar: تاريخ غير صالح
he: לא תאריך חוקי

source: Not a valid CVC
ar: سيرة ذاتية غير صالحة
he: CVC לא חוקי

source: Save
ar: حفظ
he: שמור

source: Edit
ar: تعديل
he: עריכה

source: Not a valid full name
ar: اسم غير صالح
he: שם מלא לא תקין

source: Email Address
ar: البريد الإلكتروني
he: כתובת אימייל

source: Not a valid email
ar: بريد الكتروني غير صالح
he: אימייל לא תקין

source: Not a valid phone
ar: رقم الجوال غير صالح
he: מספר טלפון לא חוקי

source: Not a valid address
ar: العنوان غير صالح
he: כתובת לא תקינה

source: Not a valid biography
ar: نبذة غير صالحة
he: ביוגרפיה לא חוקית

source: Your biography
ar: نبذة عنك
he: הביוגרפיה שלך

source: Your Address
ar: عنوانك
he: הכתובת שלך

source: Search
ar: بحث
he: חיפוש

source: Recents Search
ar: عمليات البحث الأخيرة
he: חיפושים אחרונים

source: Verify your internet connection
ar: تحقق من اتصال الإنترنت
he: אמת את חיבור האינטרנט שלך

# carts_refreshed_successfuly
source: Carts refreshed successfully
ar: تم تحديث السلة بنجاح
he: עגלות רעננו בהצלחה

# the_food_was_removed_from_your_cart
source: The {foodname} was removed from your cart
ar: تمت إزالة {foodname} من سلة التسوق
he: ה{foodname} הוסר מהעגלה שלך

# category_refreshed_successfuly
source: Category refreshed successfully
ar: تم تحديث التصنيف بنجاح
he: הקטגוריה רעננה בהצלחה

# notifications_refreshed_successfuly
source: Notifications refreshed successfully
ar: تم تحديث الإشعارات بنجاح
he: התראות רעננו בהצלחה

# order_refreshed_successfuly
source: Order refreshed successfully
ar: تم تحديث الطلب بنجاح
he: הזמנה רעננה בהצלחה

# orders_refreshed_successfuly
source: Orders refreshed successfully
ar: تم تحديث الطلبات بنجاح
he: הזמנות רעננו בהצלחה

# restaurant_refreshed_successfuly
source: Restaurant refreshed successfully
ar: تم تحديث المطبخ بنجاح
he: מסעדה רעננה בהצלחה

source: Profile settings updated successfully
ar: تم تحديث إعدادات الملف الشخصي بنجاح
he: הגדרות הפרופיל עודכנו בהצלחה

source: Payment settings updated successfully
ar: تم تحديث إعدادات الدفع بنجاح
he: הגדרות התשלום עודכנו בהצלחה

# tracking_refreshed_successfuly
source: Tracking refreshed successfully
ar: تم تحديث قائمة التتبع بنجاح
he: מעקב רענן בהצלחה

source: Welcome
ar: مرحبا
he: ברוך הבא

source: Wrong email or password
ar: بريد إلكتروني أو كلمة مرور خاطئة
he: כתובת האימייל או הסיסמה שגויים

source: Addresses refreshed successfuly
ar: تم تحديث العناوين بنجاح
he: כתובות רעננו בהצלחה

source: Delivery Addresses
ar: عناوين التوصيل
he: כתובות משלוח

source: Add
ar: اضافة
he: הוסף

source: New Address added successfully
ar: تمت اضافة العنوان الجديد بنجاح
he: כתובת חדשה התווספה בהצלחה

source: The address updated successfully
ar: تم تحديث العنوان بنجاح
he: הכתובת עודכנה בהצלחה

source: Long press to edit item, swipe item to delete it
ar: اضغط مطولا لتحرير العنصر، اسحب الى الجنب لحذفه
he: לחיצה ארוכה לעריכת פריט, החלק פריט למחיקה

source: Add Delivery Address
ar: اضافة عنوان للتوصيل
he: הוסף כתובת משלוח

source: Home Address
ar: المنزل
he: כתובת בית

source: Description
ar: الوصف
he: תיאור

# hint_full_address
source: 12 Street, City 21663, Country
ar: المدينة المنورة ، حي الازهري ، الشارع العام ، خلف مكتبة الحرمين
he: הזן את כתובת המלאה שלך

source: Full Address
ar: العنوان بالكامل
he: כתובת מלאה

source: Email to reset password
ar: استعادة كلمة المرور بالبريد الالكتروني
he: דואר אלקטרוני לאיפוס סיסמה

# send_password_reset_link
source: Send link
ar: ارسل رابط استعادة كلمة المرور
he: שלח קישור

source: I remember my password return to login
ar: تذكرت كلمة المرور، ارجع لشاشة الدخول
he: אני זוכר את הסיסמה שלי, חזרה להתחברות

source: Your reset link has been sent to your email
ar: تم ارسال رابط استعادة كلمة المرور الى البريد الالكتروني الخاص بك
he: קישור האיפוס שלך נשלח לדואר האלקטרוני שלך

source: Error! Verify email settings
ar: البريد الالكتروني غير مسجل لدينا
he: שגיאה! אמת הגדרות דוא"ל

source: Guest
ar: زائر
he: אורח

source: You must sign-in to access to this section
ar: يجب تسجيل الدخول لمشاهدة هذه الصفحة
he: עליך להתחבר כדי לגשת לחלק זה

source: Tell us about this restaurant
he: ספר לנו על המסעדה הזו

source: How would you rate this restaurant ?
ar: كيف تقيّم هذا المطعم؟
he: איך תדרג את המסעדה הזו?

source: Tell us about this food
ar: أخبرنا عن هذا الطعام
he: ספר לנו על האוכל הזה

source: The restaurant has been rated successfully
ar: تم تقييم المطعم بنجاح
he: המסעדה דורגה בהצלחה

source: The food has been rated successfully
ar: تم تقييم الطعام بنجاح
he: האוכל דורג בהצלחה

source: Reviews refreshed successfully!
ar: تم تحديث المراجعات بنجاح!
he: ביקורות רעננו בהצלחה!

source: Delivery Fee
ar: رسوم التوصيل
he: דמי משלוח

source: Order status changed
ar: تم تغيير حالة الطلب
he: סטטוס ההזמנה השתנה

source: New order from client
ar: طلب جديد من عميل
he: הזמנה חדשה מלקוח

source: Shopping
he: קניות

source: Delivery or Pickup
he: משלוח או איסוף

source: Payment card updated successfully
he: כרטיס התשלום עודכן בהצלחה

source: Deliverable
he: ניתן למשלוח

source: Not Deliverable
he: לא ניתן למשלוח

source: Items
he: פריטים

source: Delivery
ar: توصيل
he: משלוח

source: Pickup
ar: استلام
he: איסוף

source: Closed
he: סגור

source: Open
he: פתוח

source: Km
ar: كم
he: ק"מ

source: mi
ar: ميل
he: מייל

source: Delivery Address
he: כתובת למשלוח

source: Current location
he: מיקום נוכחי

source: Delivery Address removed successfully
he: כתובת למשלוח הוסרה בהצלחה

source: Add new delivery address
he: הוסף כתובת למשלוח חדשה

source: Restaurants near to your current location
he: מסעדות בקרבת מקום הנוכחי שלך

source: Restaurants near to
he: מסעדות בקרבת

source: Near to
he: בקרבת

source: Near to your current location
he: בקרבת מיקום הנוכחי שלך

source: Pickup your food from the restaurant
he: איסוף המזון שלך מהמסעדה

source: Confirm your delivery address
he: אישור כתובת המשלוח שלך

source: Filter
ar: تصفية
he: סנן

source: Clear
he: נקה

source: Apply Filters
he: החל סינון

source: Opened Restaurants
he: מסעדות פתוחות

source: Fields
he: שדות

source: This food was added to cart
ar: تم إضافة المنتج إلى السلة
he: האוכל הזה נוסף לעגלה

source: Foods result
he: תוצאת מזונות

source: Foods Results
he: תוצאות מזונות

source: Restaurants Results
he: תוצאות מסעדות

source: All
he: הכל

source: This restaurant is closed !
he: המסעדה הזו סגורה

source: Unknown
ar: غير معروف
he: לא ידוע

source: How would you rate this restaurant ?
he: איך היית מדרג את המסעדה הזו?

source: Click on the stars below to leave comments
ar: انقر على النجوم أدناه لترك تعليق
he: לחץ על הכוכבים למטה כדי להשאיר תגובות

# click_to_confirm_your_address_and_pay_or_long_press
source: Click to confirm your address and pay or Long press to edit your address
he: לחץ כדי לאשר את כתובתך ולשלם או ללחוץ לחיצה ארוכה כדי לערוך את כתובתך

source: Visa Card
he: כרטיס Visa

# iCredit
source: Pay now
ar: ادفع الآن
he: שלם עכשיו

source: Pay on Pickup
he: תשלום באיסוף

source: Click to pay with your Visa Card
he: לחץ כדי לשלם עם כרטיס ה-Visa שלך

# click_to_pay_with_icredit
source: Click to pay with your iCredit
he: לחץ כדי לשלם עם האי-קרדיט שלך

source: Click to pay with your MasterCard
he: לחץ כדי לשלם עם כרטיס ה-MasterCard שלך

source: Click to pay with your PayPal account
he: לחץ כדי לשלם עם חשבון ה-PayPal שלך

source: Click to pay cash on delivery
he: לחץ כדי לשלם במזומן במשלוח

source: Click to pay on pickup
he: לחץ כדי לשלם באיסוף

source: This email account exists
he: חשבון דוא"ל זה כבר קיים

source: This account not exist
he: החשבון הזה לא קיים

source: CARD NUMBER
ar: رقم البطاقة
he: מספר כרטיס

source: EXPIRY DATE
ar: تاريخ الانتهاء
he: תאריך תפוגה

source: Your credit card not valid
ar: بطاقتك غير صالحة
he: כרטיס האשראי שלך לא תקין

source: Number
he: מספר

source: Exp Date
he: תאריך תפוגה

source: Cuisines
ar: المطابخ
he: סוגי מטבח

# favorites_refreshed_successfuly
source: Favorites refreshed successfully
ar: تم تحديث المفضلة بنجاح
he: המועדפים רעננו בהצלחה

source: Complete your profile details to continue
ar: أكمل تفاصيل ملفك الشخصي للمتابعة
he: השלם את פרטי הפרופיל שלך כדי להמשיך

# faqsRefreshedSuccessfuly
source: Faqs refreshed successfully
ar: تم تحديث الأسئلة الشائعة بنجاح
he: שאלות נפוצות רעננו בהצלחה

source: This food was added to favorite
ar: تمت إضافة هذا الطعام إلى المفضلة
he: המזון הזה נוסף למועדפים

source: This food was removed from favorites
ar: تمت إزالة هذا الطعام من المفضلة
he: המזון הזה הוסר מהמועדפים

# foodRefreshedSuccessfuly
source: Food refreshed successfully
ar: تم تحديث الطعام بنجاح
he: המזון רענן בהצלחה

source: Delivery address outside the delivery range of this restaurants.
he: כתובת המשלוח מחוץ לטווח המשלוח של המסעדות הללו.

source: This restaurant not support delivery method.
he: המסעדה הזו לא תומכת בשיטת משלוח.

source: One or more foods in your cart not deliverable.
he: פריט או יותר בעגלתך אינם ניתנים למשלוח.

source: Delivery method not allowed!
he: שיטת המשלוח אינה מורשת!

source: View Details
he: צפה בפרטים

source: You don't have any order
he: אין לך הזמנות

source: Order Details
he: פרטי הזמנה

source: Order
he: הזמנה

source: Details
he: פרטים

source: Canceled
he: בוטל

source: Cancel Order
he: בטל הזמנה

source: View
he: הצג

source: Yes
he: כן

source: Are you sure you want to cancel this order?
he: האם אתה בטוח שברצונך לבטל הזמנה זו?

# orderThisorderidHasBeenCanceled
source: Order: #{id} has been canceled
he: הזמנה: #{id} בוטלה

source: Click on the food to get more details about it
he: לחץ על האוכל כדי לקבל פרטים נוספים עליו

source: RazorPay Payment
ar: دفع RazorPay
he: תשלום Razorpay

source: Click to pay with RazorPay method
ar: انقر للدفع باستخدام طريقة RazorPay
he: לחץ כדי לשלם עם שיטת RazorPay

source: Tap again to leave
he: הקש שוב כדי לצאת

# validCouponCode
source: Valid Coupon
ar: رمز القسيمة صالح
he: קוד קופון תקף

# invalidCouponCode
source: Invalid Coupon
ar: رمز القسيمة غير صالح
he: קוד קופון לא תקין

source: Add a promo code
ar: اضافة رمز الخصم
he: הוסף קוד קופון

source: Enter here
ar: ادخل هنا
he: הזן כאן

source: Have Coupon Code?
ar: هل لديك رمز قسيمة؟
he: יש לך קוד קופון?

source: Messages
ar: الرسائل
he: הודעות

source: You don't have any conversations
ar: لا توجد أي محادثات لديك
he: אין לך שיחות

source: New message from
ar: رسالة جديدة من
he: הודעה חדשה מ

source: For more details, please chat with our managers
ar: لمزيد من التفاصيل، يرجى الدردشة مع مديرينا
he: לפרטים נוספים, אנא שוחח עם המנהלים שלנו

source: Sign-In to chat with our managers
ar: قم بتسجيل الدخول للدردشة مع مديرينا
he: היכנס כדי לשוחח עם המנהלים שלנו

source: Type to start chat
ar: اكتب لبدء المحادثة
he: הקלד כדי להתחיל צ'אט

source: Make it default
ar: اجعله الافتراضي
he: הפוך לברירת מחדל

source: Not valid address
ar: العنوان غير صالح
he: כתובת לא תקפה

source: Swipe left the notification to delete or read / unread it
ar: اسحب الإشعار إلى اليسار لحذفه أو تمييزه كمقروء/غير مقروء
he: גרור שמאלה את ההתראה כדי למחוק אותה או לקרוא / לא לקרוא אותה

source: This notification has marked as unread
ar: تم تمييز هذا الإشعار كغير مقروء
he: ההתראה הזו סומנה כלא נקראה

source: Notification was removed
ar: تم حذف الإشعار
he: ההתראה הוסרה

source: This notification has marked as read
ar: تم تمييز هذا الإشعار كمقروء
he: ההתראה הזו סומנה כנקראה

source: Phone Number
ar: رقم الهاتف
he: מספר טלפון

source: SMS has been sent to
he: SMS נשלח אל

# weAreSendingOtpToValidateYourMobileNumberHang
source: We are sending OTP to validate your mobile number. Hang on!
he: אנו שולחים OTP לאימות מספר הטלפון הנייד שלך

source: Verify Phone Number
he: אמת מספר טלפון

source: Check on Waze:
ar: افحص الموقع على تطبيق Waze:
he: בדוק ב-Waze:

source: Restaurants
ar: المطاعم
he: מסעדות

source: Stores
ar: المتاجر
he: חנויות

source: Chats
ar: المحادثات
he: צ'אטים

# open_until
source: Open until {time}
ar: مفتوح حتى {time}
he: פתוח עד {time}

source: More
ar: المزيد
he: עוד

source: Login successful
ar: تم تسجيل الدخول بنجاح
he: התחברה בהצלחה

# already_logged_in
source: You are already logged in
ar: أنت مسجّل دخول مسبقًا
he: אתה כבר מחובר

# register_successful
source: Registration successful
ar: تم التسجيل بنجاح
he: ההרשמה הצליחה

# please_fill_all_fields
source: Please fill all fields correctly
ar: الرجاء تعبئة جميع الحقول بشكل صحيح
he: אנא מלא את כל השדות כראוי

# wrong_password
source: Incorrect password
ar: كلمة المرور غير صحيحة
he: הסיסמה שגויה

source: Login with Facebook
ar: تسجيل الدخول عبر فيسبوك
he: התחבר עם פייסבוק

source: Login with Google
ar: تسجيل الدخول عبر جوجل
he: התחבר עם גוגל

source: Login with Apple
ar: تسجيل الدخول عبر آبل
he: התחבר עם אפל

# login_success
source: Login successful!
ar: تم تسجيل الدخول بنجاح!
he: התחברות הצליחה!

source: Maps
ar: الخرائط
he: מפות

# deliveryAddressOutsideRange
source: Your address is out of the delivery range. Please select pickup or change your address.
ar: عنوانك خارج نطاق التوصيل. يرجى اختيار الاستلام من المتجر أو تغيير العنوان.
he: הכתובת שלך מחוץ לאזור המשלוח. אנא בחר באיסוף עצמי או שנה את הכתובת.

source: Card deleted successfully
ar: تم حذف البطاقة بنجاح
he: הכרטיס נמחק בהצלחה

source: Card added successfully
ar: تمت إضافة البطاقة بنجاح
he: הכרטיס נוסף בהצלחה

source: Delete
ar: حذف
he: מחיקה

source: No restaurants found
ar: لم يتم العثور على مطاعم
he: לא נמצאו מסעדות

source: No stores found
ar: لم يتم العثور على متاجر
he: לא נמצאו חנויות

source: Verify Code
ar: تحقق من الرمز
he: אמת קוד

# enterThe4DigitCodeSentTo
source: Enter the 4-digit code sent to {phone}
ar: أدخل الرمز المكون من 4 أرقام المُرسل إلى {phone}
he: הזן את הקוד בן 4 הספרות שנשלח ל-{phone}

source: Didn't receive the code? Resend it
ar: لم يصلك الرمز؟ أعد الإرسال
he: לא קיבלת את הקוד? שלח שוב

source: Forgot password?
ar: هل نسيت كلمة المرور؟
he: שכחת סיסמה?

source: Sign
ar: إنشاء حساب
he: הרשמה

# do_not_have_account
source: Don’t have an account?
ar: ليس لديك حساب؟
he: אין לך חשבון?

source: Add New Card
ar: أضف بطاقة جديدة
he: הוסף כרטיס חדש

source: Debug
ar: تصحيح الأخطاء
he: ניפוי באגים

source: Select
ar: اختر
he: בחר

source: Add New Credit Card
ar: إضافة بطاقة ائتمانية جديدة
he: הוספת כרטיס אשראי חדש

source: Add Credit Card
ar: أضف بطاقة ائتمانية جديدة
he: הוסף כרטיס אשראי חדש

source: No saved cards
ar: لا توجد بطاقات محفوظة
he: אין כרטיסים שמורים

# select_extras
source: Select extras to add them on the food
ar: اختر الإضافات لإضافتها على الطعام
he: בחר תוספות

# added_to_cart
source: {foodName} has been added to the cart
ar: تم إضافة {foodName} إلى السلة
he: {foodName} נוסף לעגלה

source: Complete Payment
ar: إكمال الدفع
he: השלם תשלום

source: Payments
ar: المدفوعات
he: תשלומים

# card_already_exist
source: The card is Already Exist
ar: البطاقة موجودة بالفعل
he: הכרטיס כבר קיים

source: Complete Order
ar: إكمال الطلب
he: השלם הזמנה

# transaction_declined
source: Transaction has been declined
ar: تم رفض المعاملة
he: העסקה נדחתה

# tips_complete_order
source: Tips to complete your order
ar: نصائح لإكمال طلبك
he: טיפים להשלמת ההזמנה שלך

# tip_check_card_info
source: • Double-check your card information.
ar: • تحقق من معلومات البطاقة جيدًا.
he: • בדוק שוב את פרטי הכרטיס שלך.

# tip_use_different_card
source: • Use a different card or alternative method.
ar: • استخدم بطاقة أخرى أو طريقة بديلة.
he: • השתמש בכרטיס אחר או שיטה חלופית.

# tip_contact_issuer
source: • Contact your card issuer to verify your account.
ar: • تواصل مع الجهة المصدرة للبطاقة لتأكيد الحساب.
he: • פנה לחברת הכרטיס לאימות החשבון שלך.

# go_back_checkout
source: Go back to checkout
ar: الرجوع إلى صفحة الدفع
he: חזור לדף התשלום

source: Most ordered
ar: الأكثر طلبًا
he: הכי מוזמן

# delivery_20_30_mnt
source: Delivery 20–30 min
ar: التوصيل خلال 20–30 دقيقة
he: משלוח תוך 20–30 דקות

source: Test Notifications
ar: اختبار الإشعارات
he: בדיקת התראות

source: Test Notification
ar: إشعار تجريبي
he: התראה לבדיקה

# testNotificationBody
source: This is a test notification!
ar: هذا إشعار تجريبي!
he: זוהי התראה לבדיקה

source: Test notification sent!
ar: تم إرسال الإشعار التجريبي!
he: ההתראה לבדיקה נשלחה בהצלחה

source: Unread Notifications
ar: إشعارات غير مقروءة
he: התראות שלא נקראו

# notificationsTestTitle
source: 🧪 Notification Test
ar: 🧪 اختبار الإشعارات
he: בדיקת התראות

source: Refresh Notification Count
ar: تحديث عدد الإشعارات
he: רענן מספר התראות

source: Test Local Notification
ar: اختبار إشعار محلي
he: בדוק התראה מקומית

source: Fetch All Notifications
ar: جلب جميع الإشعارات
he: קבל את כל ההתראות

source: Go to Notifications Page
ar: الذهاب لصفحة الإشعارات
he: עבור לדף התראות

source: Test API Connection
ar: اختبار الاتصال بالـ API
he: בדוק חיבור API

source: Testing API connection...
ar: جاري اختبار الاتصال بالـ API...
he: בודק חיבור API...

# apiConnectionSuccess
source: ✅ Success! Notification count: {count}
ar: ✅ تم بنجاح! عدد الإشعارات: {count}
he: חיבור API הצליח. נמצאו {count} התראות

# apiConnectionFailed
source: ❌ Connection failed: {error}
ar: ❌ فشل في الاتصال: {error}
he: חיבור API נכשל: {error}

# errorFetchingNotifications
source: Error fetching notifications: {error}
ar: خطأ في جلب الإشعارات: {error}
he: שגיאה בקבלת התראות: {error}

# apiInfoTitle
source: API Info
ar: معلومات الـ API
he: מידע API

# apiEndpoint
source: Endpoint: https://carrytechnologies.co/api/notifications
ar: النقطة الطرفية: https://carrytechnologies.co/api/notifications
he: נקודת קצה API

# apiToken
source: Token: fXLu7VeYgXDu82SkMxlLPG1mCAXc4EBIx6O5isgYVIKFQiHah0xiOHmzNsBv
ar: التوكن: fXLu7VeYgXDu82SkMxlLPG1mCAXc4EBIx6O5isgYVIKFQiHah0xiOHmzNsBv
he: אסימון API

source: Tracking
ar: تتبع
he: מעקב

source: Loading route...
ar: جاري تحميل المسار...
he: טוען מסלול...

source: Not available now
ar: غير متوفر الآن
he: לא זמין כרגע

# twentyToThirtyMin
source: 20–30 min
ar: 20–30 دقيقة
he: 20-30 דקות

source: Discount
ar: خصم
he: הנחה

source: Pay now
ar: ادفع الآن
he: שלם עכשיו

source: Change
ar: تغيير
he: שנה

source: Address Details
ar: تفاصيل العنوان
he: פרטי כתובת

source: Adding exact address details helps us find you faster
ar: إضافة تفاصيل دقيقة للعنوان تساعدنا في العثور عليك بشكل أسرع
he: הוספת פרטי כתובת מדויקים עוזרת לנו למצוא אותך מהר יותר

source: Building Name
ar: اسم المبنى
he: שם המבנה

source: Optional
ar: اختياري
he: אופציונלי

source: Entrance / Staircase
ar: المدخل / السلم
he: כניסה / מדרגות

source: Floor
ar: الطابق
he: קומה

source: Apartment
ar: شقة
he: דירה

source: How do we get in?
ar: كيف ندخل؟
he: איך אנחנו נכנסים?

source: Doorbell / Intercom
ar: جرس الباب / الاتصال الداخلي
he: פעמון דלת / אינטרקום

source: Door Code
ar: رمز الباب
he: קוד דלת

source: Door is Open
ar: الباب مفتوح
he: הדלת פתוחה

source: Other (tell us how)
ar: آخر (أخبرنا كيف)
he: אחר (ספר לנו איך)

source: Other instructions for the courier
ar: تعليمات أخرى للساعي
he: הוראות נוספות לשליח

source: Address Type and Label
ar: نوع العنوان والوسم
he: סוג כתובת ותווית

source: Add or create address labels to easily choose between delivery addresses.
ar: أضف أو أنشئ وسمًا للعناوين لتسهيل اختيار عنوان التوصيل.
he: הוסף או צור תוויות כתובת כדי לבחור בקלות בין כתובות משלוח

source: Work
ar: العمل
he: עבודה

source: Other
ar: أخرى
he: אחר

source: Add New Address
ar: إضافة عنوان جديد
he: הוסף כתובת חדשה
