Repository: mhmdajoor5/Jetak-mobile-client-develop
Catalog: lib/l10n/intl_*.arb
Languages: ar, he

source: Home Address
ar: عنوان المنزل
he: כתובת הבית

source: Full Address
ar: العنوان الكامل
he: כתובת מלאה

source: Street, City, Country
ar: شارع، مدينة، دولة
he: רחוב, עיר, מדינה

# pleaseEnterOrSelectAddress
source: Please enter or select an address
ar: يرجى إدخال أو اختيار عنوان
he: אנא הזן או בחר כתובת

# continueBtn
source: Continue
ar: متابعة
he: המשך

# locationServiceDisabled
source: Location service is disabled
ar: خدمة الموقع معطلة
he: שירות המיקום מושבת

# locationPermissionDeniedForever
source: Location permission denied permanently
ar: تم رفض صلاحيات الموقع نهائياً
he: ההרשאה למיקום נדחתה לצמיתות

# locationFetchError
source: Unable to determine location
ar: تعذر تحديد الموقع
he: לא ניתן לקבוע מיקום

# locationBasedMessage
source: Based on your phone's location, it looks like you're here:
ar: بناءً على موقع هاتفك، يبدو أنك هنا:
he: בהתבסס על מיקום הטלפון שלך, נראה שאתה כאן:

source: Please wait...
ar: يرجى الانتظار...
he: אנא המתן...

source: Use this address
ar: استخدم هذا العنوان
he: השתמש בכתובת זו

source: Enter another address
ar: أدخل عنوانًا آخر
he: הזן כתובת אחרת

source: Location Type
ar: نوع الموقع
he: סוג מיקום

# locationTypeHint
source: Select location type
ar: اختر نوع الموقع
he: בחר סוג מיקום

source: Select location type
ar: اختر نوع الموقع
he: בחר סוג מיקום

# search_for_restaurants_or_foods
source: Search for food, chef, etc
ar: ابحث عن مطاعم أو أطعمة
he: חפש מסעדות או מזונות

source: Order Summary
ar: ملخص الطلب
he: סיכום הזמנה

# include_tax
source: Include tax ( if applicable )
ar: اضف الضريبة (ان وجدت)
he: כולל מס

source: Item subtotal
ar: المجموع الفرعي للعنصر
he: סכום ביניים של פריטים

source: Service fee
ar: ضريبة الخدمة
he: דמי שירות

source: Promo
ar: الخصم
he: קופון

source: Ordered by Nearby first
ar: مرتبة حسب الأقرب أولاً
he: מסודר על פי קרבה ראשית

source: Add to Cart
ar: أضف إلى السلة
he: הוסף לעגלה

source: Favorite Foods
ar: الأطعمة المفضلة
he: מזונות מועדפים

source: Order Id
ar: رقم الطلب
he: מזהה הזמנה

source: I don't have an account?
ar: لا أملك حسابًا
he: אין לי חשבון

source: Top Restaurants
ar: أفضل المطاعم
he: מסעדות מובילות

source: Most Popular
ar: الأكثر شهرة
he: הכי פופולרי

source: Trending This Week
ar: الشائع هذا الأسبوع
he: טרנד השבוע

source: Maps Explorer
ar: مستكشف الخرائط
he: חוקר מפות

source: Payment Mode
ar: طريقة الدفع
he: מצב תשלום

source: Select your preferred payment mode
ar: اختر طريقة الدفع المفضلة
he: בחר את מצב התשלום המועדף עליך

source: Or Checkout With
ar: أو ادفع بواسطة
he: או צ'קאאוט עם

source: Estimated time
ar: الوقت المتوقع
he: זמן משוער

source: Confirm Payment
ar: تأكيد الدفع
he: אשר תשלום

source: Help & Supports
ar: المساعدة والدعم
he: עזרה ותמיכה

source: Your order has been successfully submitted!
ar: تم إرسال طلبك بنجاح
he: ההזמנה שלך נשלחה בהצלחה

source: Featured Foods
ar: الأطعمة المميزة
he: מזונות מובילים

source: What They Say ?
ar: آراء العملاء
he: מה הם אומרים

source: Payment method
ar: طريقة الدفع
he: אמצעי תשלום

source: Credit card
ar: بطاقة ائتمان
he: כרטיס אשראי

# double_click_on_the_food_to_add_it_to_the
source: Double click on the food to add it to the cart
ar: انقر مرتين على المنتج لإضافته إلى سلة التسوق

source: Food Categories
ar: الفئات

source: Recent Reviews
ar: التعليقات الأخيرة

source: Select your preferred languages
ar: اختر لغتك المفضلة

source: Select extras to add them on the food
ar: اختر الاضافات

source: App Language
ar: لغة التطبيق

source: I forgot password ?
ar: نسيت كلمة المرور؟

source: All Menu
ar: كل المينو

source: Longpress on the food to add suplements
ar: إضغط على المنتج لإضافة

source: Cash
ar: نقداً

source: Add courier tip
ar: إضافة إكرامية عامل التوصيل

source: Payment
ar: الدقع

source: Pay now
ar: ادفع الان

# no_items_in_this_category
source: No items found in this category
ar: لا توجد عناصر في هذه الفئة

# choose_your_location
source: Please , Choose Your Location
ar: برجاء تحديد موقعك
